In [1]:
# importing pandas
import pandas as pd
dataFrame = pd.DataFrame([[2,4,6],[10,20,30]], columns=["col1", "col2", "col3"], index=["row1","row2"])
print(dataFrame)

      col1  col2  col3
row1     2     4     6
row2    10    20    30

In [2]:
# Selecting column 1
print(dataFrame.col1)

# Calculating mean
print(dataFrame.col1.mean())

row1     2
row2    10
Name: col1, dtype: int64
6.0

In [3]:
# Using Dictionaries as dataframes
datos = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
df2 = pd.DataFrame.from_dict(datos)
print(df2)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [4]:
# Printing shape parameters
size = df2.shape
rows = size[0]
cols = size[1]

print(size)
print(rows)
print(cols)

(4, 2)
4
2

In [5]:
# 
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 4),['row1', 'row2', 'row3', 'row4', 'row5'], ['col1', 'col2', 'col3', 'col4'])
df

          col1      col2      col3      col4
row1 -1.903667 -0.639821 -0.755471 -1.698300
row2  0.821490 -0.762030 -0.165347  0.867966
row3  1.974407 -0.340833  0.275650 -1.087880
row4  0.465095  0.819276 -0.279347  0.314668
row5  1.728277 -0.377602  1.015694 -0.415025

In [6]:
# Selecting column
df['col1'] # df.col1

row1   -1.903667
row2    0.821490
row3    1.974407
row4    0.465095
row5    1.728277
Name: col1, dtype: float64

In [7]:
# Selecting two columns
df[['col1', 'col2']]

          col1      col2
row1 -1.903667 -0.639821
row2  0.821490 -0.762030
row3  1.974407 -0.340833
row4  0.465095  0.819276
row5  1.728277 -0.377602

In [8]:
# Generating new column
df['other'] = df['col3'] + df['col4']
df

          col1      col2      col3      col4     other
row1 -1.903667 -0.639821 -0.755471 -1.698300 -2.453771
row2  0.821490 -0.762030 -0.165347  0.867966  0.702619
row3  1.974407 -0.340833  0.275650 -1.087880 -0.812230
row4  0.465095  0.819276 -0.279347  0.314668  0.035322
row5  1.728277 -0.377602  1.015694 -0.415025  0.600668

In [9]:
# Dropping columns
# Inplace is for save data
df.drop('other', axis = 1, inplace = True)
df

          col1      col2      col3      col4
row1 -1.903667 -0.639821 -0.755471 -1.698300
row2  0.821490 -0.762030 -0.165347  0.867966
row3  1.974407 -0.340833  0.275650 -1.087880
row4  0.465095  0.819276 -0.279347  0.314668
row5  1.728277 -0.377602  1.015694 -0.415025

In [10]:
# Dropping Rows
df.drop('row1')

          col1      col2      col3      col4
row2  0.821490 -0.762030 -0.165347  0.867966
row3  1.974407 -0.340833  0.275650 -1.087880
row4  0.465095  0.819276 -0.279347  0.314668
row5  1.728277 -0.377602  1.015694 -0.415025

In [13]:
# row was not deleted
# it needs inplace parameter in True
df

          col1      col2      col3      col4
row1 -1.903667 -0.639821 -0.755471 -1.698300
row2  0.821490 -0.762030 -0.165347  0.867966
row3  1.974407 -0.340833  0.275650 -1.087880
row4  0.465095  0.819276 -0.279347  0.314668
row5  1.728277 -0.377602  1.015694 -0.415025

In [15]:
# Using loc method for named index
df.loc['row1']

col1   -1.903667
col2   -0.639821
col3   -0.755471
col4   -1.698300
Name: row1, dtype: float64

In [16]:
# using iloc for numeric index
df.iloc[0]

col1   -1.903667
col2   -0.639821
col3   -0.755471
col4   -1.698300
Name: row1, dtype: float64

In [18]:
# Selecting specific values
df.loc['row1', 'col2']

-0.6398205487264889

In [19]:
#Selecting several values
df.loc[['row1', 'row2'],['col1', 'col3']]

          col1      col3
row1 -1.903667 -0.755471
row2  0.821490 -0.165347

In [20]:
# Conditional selecting
df[df['col1'] > 0]

          col1      col2      col3      col4
row2  0.821490 -0.762030 -0.165347  0.867966
row3  1.974407 -0.340833  0.275650 -1.087880
row4  0.465095  0.819276 -0.279347  0.314668
row5  1.728277 -0.377602  1.015694 -0.415025

In [22]:
# Selecting from conditionals
df[df['col1'] > 0][['col2', 'col4']]

          col2      col4
row2 -0.762030  0.867966
row3 -0.340833 -1.087880
row4  0.819276  0.314668
row5 -0.377602 -0.415025

In [23]:
# Multiple conditions
# & is for "and" in columns. | is for "or"
df[(df['col1'] < 0) & (df['col3'] < 0)]

          col1      col2      col3    col4
row1 -1.903667 -0.639821 -0.755471 -1.6983

In [24]:
# Multiple levels for index
out_ = ['O1', 'O1', 'O1', 'O2', 'O2', 'O2']
in_ = [1, 2, 3, 1, 2, 3]
h_index = list(zip(out_, in_))
h_index = pd.MultiIndex.from_tuples(h_index)

In [25]:
import numpy as np
import pandas as pn

df_m = pn.DataFrame(np.random.rand(6,5), h_index, ['col1', 'col2', 'col3', 'col4', 'col5'])
df_m

          col1      col2      col3      col4      col5
O1 1  0.416151  0.128245  0.358726  0.098504  0.952776
   2  0.571702  0.345877  0.474492  0.678917  0.308472
   3  0.381333  0.609416  0.877647  0.250261  0.356143
O2 1  0.107125  0.715601  0.989043  0.318114  0.140604
   2  0.500292  0.318066  0.199230  0.338056  0.208442
   3  0.654158  0.747790  0.448986  0.893007  0.902087

In [26]:
# Adding names to indexes
df_m.index.names = ['Groups','Nums']
df_m

                 col1      col2      col3      col4      col5
Groups Nums
O1     1     0.416151  0.128245  0.358726  0.098504  0.952776
       2     0.571702  0.345877  0.474492  0.678917  0.308472
       3     0.381333  0.609416  0.877647  0.250261  0.356143
O2     1     0.107125  0.715601  0.989043  0.318114  0.140604
       2     0.500292  0.318066  0.199230  0.338056  0.208442
       3     0.654158  0.747790  0.448986  0.893007  0.902087

In [27]:
# Selecting a sub dataframe
df_m.loc['O1']

          col1      col2      col3      col4      col5
Nums
1     0.416151  0.128245  0.358726  0.098504  0.952776
2     0.571702  0.345877  0.474492  0.678917  0.308472
3     0.381333  0.609416  0.877647  0.250261  0.356143

In [28]:
# Using missing values
d = {'A':[10, np.nan], 'B':[np.nan, 50] }
df_d = pn.DataFrame(d)
df_d

      A     B
0  10.0   NaN
1   NaN  50.0

In [29]:
df_d.dropna()

Empty DataFrame
Columns: [A, B]
Index: []

In [30]:
df_d.fillna('filled')

        A       B
0      10  filled
1  filled      50